{
    "general": {
        "home": "Home",
        "about-me": "Acerca de mí",
        "post-card-link-aria-label": "Lee al completo el artículo",
        "heading-link-aria-label": "Haz click aquí para navegar hasta el punto del post",
        "internal-link-aria-label": "Haz click aquí para navegar hasta el punto de la página",
        "main-navigation-link-aria-label": "Haz click aquí para ir a la página",
        "social-link-aria-label": "Haz click aquí para ver mi perfil de"
    },
    "home": {
        "title": "Hola, soy José",
        "nav": {
            "home": "Home.",
            "about-me": "Acerca de mí.",
            "blog": "Blog."
        },
        "header": {
            "title": "Ingeniero de software, <0>multipotencial</0> y persona creativa.",
            "description": "Hola, soy José. Más de 10 años de experiencia en la industria tecnológica y Tech Lead Engineer en Sopra Steria."
        },
        "about-me": {
            "description": "Conoce un poco más acerca de mí",
            "paragraph-1": "Persona creativa y multipotencial, apasionado ingeniero de software, emprendedor, con un gran interés en el desarrollo personal y humano, así como en liderazgo, ética y arte.",
            "paragraph-2": "He desempeñado roles de desarrollo, análisis, arquitectura y liderazgo dentro de los equipos en los que he trabajado.",
            "paragraph-3": "Estos últimos cuatro años he estado trabajando como líder técnico en un equipo de desarrollo de videojuegos ágil utilizando tecnologías frontend de vanguardia: ES6+, reactividad, gestión de estados, webpack/vite, babel, i18next, etc.",
            "about-me-more-button-1": "Saber más",
            "about-me-more-button-2": "Descubre más información, descarga mi currículum, etc."
        },
        "posts": {
            "title": "Últimas publicaciones.",
            "description": "Algunas cosas que escribo",
            "no-posts": "No hay publicaciones por ahora",
            "more-posts-button": "Más posts"
        }
    },
    "about-me": {
        "title": "Conóceme",
        "nav": {
            "professional-experience": {
                "pre-text": "Descubre mi",
                "anchor-text": "experiencia profsional"
            },
            "work-history": {
                "pre-text": "profundiza en mi",
                "anchor-text": "historial laboral"
            },
            "cv": {
                "pre-text": "examina mi",
                "anchor-text": "CV"
            },
            "education": {
                "pre-text": "aprende sobre mi ",
                "anchor-text": "educación"
            },
            "personal-things": {
                "pre-text": "y descubre",
                "anchor-text": "algunas cosillas más",
                "final-text": "sobre mí."
            }
        },
        "professional-experience": {
            "title": "Experiencia profesional",
            "paragraph-1": "¡Hola! Soy José, un apasionado ingeniero de software con más de 10 años de experiencia en la industria tecnológica. Como líder técnico en Sopra Steria, he estado profundizando en tecnologías frontend, metodologías ágiles y soluciones orientadas a devops/nube durante más de cuatro años. Me enorgullezco de guiar a mi equipo a través de procesos, innovación y aprendizaje.",
            "paragraph-2": "Sin embargo, mi viaje no termina ahí. También me he adentrado en el mundo freelance, perfeccionando una variedad de habilidades en el camino. Como auténtico amante de la tecnología, me resulta emocionante abordar desafíos de software en mi tiempo libre, creando productos y desarrollando ideas. ¡Me encanta construir, crear y resolver problemas, eso es lo que me hace hace seguir adelante!",
            "job": {
                "sopra": {
                    "company": "Sopra Steria",
                    "time": "nov 2018 - actualidad",
                    "title": "Teach Lead Engineer",
                    "description-1": "Fase 1: Airbus Defense and Space: Arquitectura de software, análisis y desarrollo. Python, blockchain, Angular, Microservicios, UIPath, gRPC, etc.",
                    "description-2": "Fase 2 (Actual): The Workshop - Trabajando en videojuegos de casino como Ingeniero Líder en Tecnología en un entorno internacional con tecnologías Frontend y metodologías ágiles: WebGL, Pixi.js, Javascript (ES6+) OOP y patrones de diseño, Mobx, Reactividad, Jest."
                },
                "eduka": {
                    "company": "Eduka",
                    "time": "jun. 2018 - 2022",
                    "title": "Cofundador",
                    "description-1": "Me encanta aprender. Dedico una parte de mi día a ello, para poder mejorar constantemente. Es por eso que quiero llevar este deseo a todos. Transmitir esa gran sensación de verte mejorar a diario. Eduka, una startup enfocada en el proceso de aprendizaje de los niños más pequeños, ayudando tanto a ellos como a sus padres a gestionar mejor su crecimiento diario."
                },
                "indra-2": {
                    "company": "Indra",
                    "time": "nov 2018 - actualidad",
                    "title": "Software Analyst",
                    "description-1": "Análisis y desarrollo de RPAs.",
                    "description-2": "Análisis y desarrollo de herramientas/soluciones informáticas para facilitar y optimizar los tiempos de gestión en las tareas de BackOffice de Endesa.",
                    "description-3": "Proyectos de gestión y explotación de datos a través de bases de datos MySQL, Access, ASP.NET, .NET , etc.",
                    "description-4": "Desarrollo de software para automatizar tareas con Python + Selenium, Python y Ui Path."
                },
                "insous": {
                    "company": "Insous",
                    "time": "ene. 2015- jun. 2017",
                    "title": "Cofundador",
                    "description-1": "Proyecto personal en el mundo del desarrollo. Diseño y desarrollo de soluciones de software innovadoras para necesidades particulares y empresariales."
                },
                "indra-1": {
                    "company": "Indra",
                    "time": "abr. 2014 - abr. 2015",
                    "title": "Software Analyst",
                    "description-1": "Análisis y desarrollo de herramientas/soluciones informáticas para facilitar y optimizar los tiempos de gestión en las tareas de BackOffice de Endesa.",
                    "description-2": "Proyectos de gestión y explotación de datos a través de bases de datos MySQL, Access, ASP.NET, .NET, etc.",
                    "description-3": "Desarrollo de software para automatizar tareas"
                }
            }
        },
        "work-history": {
            "title": "Historial laboral"
        },
        "education": {
            "title": "Educación",
            "learning": {
                "university": {
                    "institution": "Universidad de Sevilla",
                    "title": "Grado en Ingeniería Informática - Ingeniería del Software, Ingenieríaa Informática",
                    "time": "sept. 2013"
                },
                "grado-superior": {
                    "institution": "I.E.S Punta del Verde",
                    "title": "Grado Superior Administración de Sistemas Informáticos, Administración de sistemas informáticos en red",
                    "time": "2011 - 2013"
                },
                "grado-medio": {
                    "institution": "I.E.S Ruiz Gijón",
                    "title": "Grado Medio Explotación de Sistemas Informáticos",
                    "time": "2008 - 2010"
                }
            }
        },
        "cv": {
            "title": "Curriculum Vitae"
        },
        "personal-things": {
            "title": "Algo sobre mi",
            "paragraph-1": "Como una persona naturalmente curiosa, aprendo continuamente a través de mi diversa gama de pasatiempos e intereses. Entre estos, los videojuegos ocupan un lugar especial en mi corazón, ya que me permiten explorar mundos imaginarios y vivir aventuras únicas sin salir de mi silla.",
            "paragraph-2": "La música es otra de mis pasiones; me conecta con mis emociones e inspira a crear y compartir historias a través de diversos géneros y estilos. Además, la fotografía me ha enseñado a capturar la belleza de los momentos fugaces y apreciar los detalles que a menudo pasamos por alto en nuestra vida diaria.",
            "paragraph-3": "Mi fascinación por la tecnología me mantiene siempre en busca de las últimas innovaciones, las cuales tienen el potencial de mejorar nuestras vidas y conectar con otros de maneras sorprendentes. El desarrollo personal, parte integral de mi vida, enfatiza la importancia del crecimiento y la evolución como individuo. La lectura nutre mi mente al introducirme a nuevas ideas y perspectivas, alimentando mi pasión interminable por aprender.",
            "paragraph-4": "En mi búsqueda por mantenerme actualizado, hago un esfuerzo consciente por enriquecer continuamente mi conocimiento en diversos campos. Esto implica dedicar tiempo a leer artículos, asistir a talleres y participar en cursos en línea que abarcan una amplia gama de temas, desde las tendencias emergentes en tecnología hasta los últimos avances en ciencia y arte. Al expandir mis horizontes, no solo mejoro mi conjunto de habilidades, sino que también garantizo que aporto una perspectiva equilibrada en cada proyecto que emprendo."
        }
    },
    "blog": {
        "description": "Bienvenido a la sección de Últimas Publicaciones del Blog, donde podrás ponerte al día sobre los temas en los que he estado escribiendo recientemente o sumergirte en todas mis publicaciones anteriores."
    }
}