{
    "general": {
        "about-me": "Acerca de mí"
    },
    "home": {
        "title": "Hola, soy José",
        "nav": {
            "home": "Inicio.",
            "about-me": "Acerca de mí.",
            "blog": "Blog."
        },
        "header": {
            "title": "Ingeniero de software, <0>multipotencial</0> y persona creativa.",
            "description": "Hola, soy José. Más de 10 años de experiencia en la industria tecnológica y Tech Lead Engineer en Sopra Steria."
        },
        "about-me": {
            "description": "Conoce un poco más acerca de mí",
            "paragraph-1": "Persona creativa y multipotencial, apasionado ingeniero de software, emprendedor, con un gran interés en el desarrollo personal y humano, así como en liderazgo, ética y arte.",
            "paragraph-2": "He desempeñado roles de desarrollo, análisis, arquitectura y liderazgo dentro de los equipos en los que he trabajado.",
            "paragraph-3": "Estos últimos cuatro años he estado trabajando como líder técnico en un equipo de desarrollo de videojuegos ágil utilizando tecnologías frontend de vanguardia: ES6+, reactividad, gestión de estados, webpack/vite, babel, i18next, etc.",
            "about-me-more-button-1": "Saber más",
            "about-me-more-button-2": "Descubre más información, descarga mi currículum, etc."
        },
        "posts": {
            "title": "Últimas publicaciones.",
            "description": "Algunas cosas que escribo",
            "no-posts": "No hay publicaciones por ahora",
            "more-posts-button": "Más publicaciones."
        }
    },
    "about-me": {
        "title": "Conóceme",
        "nav": " Descubre mi <0> experiencia profesional </0>, profundiza en mi <1> historial laboral </1>, examina mi <2>CV</2>, aprende sobre mi <3>educación</3> y descubre <4> información personal </4> sobre mí.",
        "professional-experience": {
            "title": "Experiencia profesional",
            "paragraph-1": "¡Hola! Soy José, un apasionado ingeniero de software con más de 10 años de experiencia en la industria tecnológica. Como líder técnico en Sopra Steria, he estado profundizando en tecnologías frontend, metodologías ágiles y soluciones orientadas a devops/nube durante más de cuatro años. Me enorgullezco de guiar a mi equipo a través de procesos, innovación y aprendizaje.",
            "paragraph-2": "Mi viaje no termina ahí, sin embargo. También me he adentrado en el mundo freelance, perfeccionando una variedad de habilidades en el camino. Como auténtico amante de la tecnología, me resulta emocionante abordar desafíos de software en mi tiempo libre, creando productos y desarrollando ideas. ¡Me encanta construir, crear y resolver problemas, eso es lo que me mantiene en marcha!"
        },
        "work-history": {
            "title": "Historial laboral"
        }
    }
}