{
    "general": {
        "home": "Home",
        "about-me": "About me"
    },
    "home": {
        "title": "Hi, I'm Jose",
        "nav": {
            "home": "Home.",
            "about-me": "About me.",
            "blog": "Blog."
        },
        "header": {
            "title": "Software engineer, <0>multipotential</0> and creative person.",
            "description": "Hi, I'm Jose. More than 10+ years of experience on the tech industry and Technical Lead Engineer at Sopra Steria."
        },
        "about-me": {
            "description": "Know a little more about me",
            "paragraph-1": "Creative & multipotential person, passionate software engineer, entrepreneur, with a strong interest in personal and human development, as well as in leadership, ethics, and art.",
            "paragraph-2": "I have played  development, analysis, architecture and leadership roles within the teams I have worked in.",
            "paragraph-3": "These last four years I've been working as a Tech Lead Engineer in an agile videogame development team using cutting-edge frontend technologies: ES6+, reactivity, statemanagement, webpack/vite, babel, i18next, etc.",
            "about-me-more-button-1": "Know more",
            "about-me-more-button-2": "Discover more info, download my resume, etc."
        },
        "posts": {
            "title": "Last posts.",
            "description": "Some stuff I write",
            "no-posts": "No posts actually",
            "more-posts-button": "More posts."
        }
    },
    "about-me": {
        "title": "Get to know me",
        "nav": " Discover my <0> professional experience </0>, delve into my <1> work history </1>, examine my <2>CV</2>, learn about my <3>education</3>, and uncover <4> personal insights </4> about me.",
        "professional-experience": {
            "title": "Professional Experience",
            "paragraph-1": "Hey there! I'm Jose, a passionate software engineer with over 10 years of experience in the tech industry. As a Tech Lead Engineer at Sopra Steria, I've been diving deep into frontend technologies, agile methodologies, and devops/cloud-oriented solutions for more than four years. I pride myself on guiding my team through processes, innovation and learning.",
            "paragraph-2": "My journey doesn't end there, though. I've also ventured into the freelance world, honing a variety of skills along the way. As a genuine tech lover, I find it thrilling to tackle software challenges in my free time, creating products and developing ideas. I'm all about building, creating, and solving problems—that's what keeps me going!"
        },
        "work-history": {
            "title": "Work History"
        }
    }
}