{
    "general": {
        "home": "Home",
        "about-me": "About me"
    },
    "home": {
        "title": "Hi, I'm Jose",
        "nav": {
            "home": "Home.",
            "about-me": "About me.",
            "blog": "Blog."
        },
        "header": {
            "title": "Software engineer, <0>multipotential</0> and creative person.",
            "description": "Hi, I'm Jose. More than 10+ years of experience on the tech industry and Technical Lead Engineer at Sopra Steria."
        },
        "about-me": {
            "description": "Know a little more about me",
            "paragraph-1": "Creative & multipotential person, passionate software engineer, entrepreneur, with a strong interest in personal and human development, as well as in leadership, ethics, and art.",
            "paragraph-2": "I have played  development, analysis, architecture and leadership roles within the teams I have worked in.",
            "paragraph-3": "These last four years I've been working as a Tech Lead Engineer in an agile videogame development team using cutting-edge frontend technologies: ES6+, reactivity, statemanagement, webpack/vite, babel, i18next, etc.",
            "about-me-more-button-1": "Know more",
            "about-me-more-button-2": "Discover more info, download my resume, etc."
        },
        "posts": {
            "title": "Last posts.",
            "description": "Some stuff I write",
            "no-posts": "No posts actually",
            "more-posts-button": "More posts."
        }
    },
    "about-me": {
        "title": "Get to know me",
        "nav": {
            "professional-experience": {
                "pre-text": "Discover my",
                "anchor-text": "professional experience"
            },
            "work-history": {
                "pre-text": "delve into my",
                "anchor-text": "work history"
            },
            "cv": {
                "pre-text": "examine my",
                "anchor-text": "CV"
            },
            "education": {
                "pre-text": "learn about my",
                "anchor-text": "education"
            },
            "personal-things": {
                "pre-text": "and uncover my",
                "anchor-text": "personal insights",
                "final-text": "about me."
            }
        },
        "professional-experience": {
            "title": "Professional Experience",
            "paragraph-1": "Hey there! I'm Jose, a passionate software engineer with over 10 years of experience in the tech industry. As a Tech Lead Engineer at Sopra Steria, I've been diving deep into frontend technologies, agile methodologies, and devops/cloud-oriented solutions for more than four years. I pride myself on guiding my team through processes, innovation and learning.",
            "paragraph-2": "My journey doesn't end there, though. I've also ventured into the freelance world, honing a variety of skills along the way. As a genuine tech lover, I find it thrilling to tackle software challenges in my free time, creating products and developing ideas. I'm all about building, creating, and solving problems—that's what keeps me going!",
            "job": {
                "sopra": {
                    "company": "Sopra Steria",
                    "time": "nov 2018 - current",
                    "title": "Tech Lead Engineer",
                    "description-1": "Phase 1: Airbus Defense and Space: Software Architecture, analysis and development. Python, blockchain, Angular, Microservices, UIPath, gRPC, etc.",
                    "description-2": "Phase 2 (Current): The Workshop - Working on Casino Videogames as Tech Lead Engineer on an international environment with Frontend Technologies and Agile Methodologies: WebGL, Pixi.js, Javascript (ES6+) OOP and design Patterns, Mobx, Reactivity, Jest."
                },
                "eduka": {
                    "company": "Eduka",
                    "time": "jun. 2018 - 2022",
                    "title": "Cofounder",
                    "description-1": "I love learning. I dedicate a part of my day to it, so that I can improve myself constantly. That is why I want to bring this desire to everyone. Transmitting that great feeling of seeing yourself improving daily. Eduka, a start-up focused on the learning process of younger children by helping both, them and their parents to better manage their everyday growth."
                },
                "indra-2": {
                    "company": "Indra",
                    "time": "nov 2018 - current",
                    "title": "jun. 2017 - 0ct.2018",
                    "description-1": "Analysis and development of RPAs.",
                    "description-2": "Analysis and development of computer tools/solutions to facilitate and optimise management times in Endesa's BackOffice tasks.",
                    "description-3": "Data management and exploitation projects through MySQL databases, Access, ASP.NET, .NET , etc.",
                    "description-4": "Development of software to automate tasks with Python + Selenium, Python and Ui Path."
                },
                "insous": {
                    "company": "Insous",
                    "time": "ene. 2015- jun. 2017",
                    "title": "Cofounder",
                    "description-1": "Personal project in the world of development. Design and development of innovative software solutions for particular and business needs."
                },
                "indra-1": {
                    "company": "Indra",
                    "time": "abr. 2014 - abr. 2015",
                    "title": "Software Analyst",
                    "description-1": "Analysis and development of computer tools/solutions to facilitate and optimise management times in Endesa's BackOffice tasks.",
                    "description-2": "Data management and exploitation projects through MySQL, Access, ASP.NET, .NET databases, etc.",
                    "description-3": "Software development to automate tasks"
                }
            }
        },
        "work-history": {
            "title": "Work History"
        },
        "education": {
            "title": "Education",
            "learning": {
                "university": {
                    "institution": "University of Seville",
                    "title": "Bachelor's Degree in Computer Engineering - Software Engineering, Computer Engineering",
                    "time": "Sept. 2013"
                },
                "grado-superior": {
                    "institution": "I.E.S Punta del Verde",
                    "title": "Advanced Degree in Computer Systems Administration, Network Computer Systems Administration",
                    "time": "2011 - 2013"
                },
                "grado-medio": {
                    "institution": "I.E.S Ruiz Gijón",
                    "title": "Intermediate Degree in Computer Systems Operation",
                    "time": "2008 - 2010"
                }
            }
        },
        "cv": {
            "title": "Curriculum Vitae"
        },
        "personal-things": {
            "title": "Personal Insights",
            "paragraph-1": "As a naturally curious individual, I continuously learn through my diverse range of hobbies and interests. Among these, video games hold a special place in my heart, allowing me to explore imaginary worlds and experience unique adventures without leaving my chair.",
            "paragraph-2": "Music is another passion of mine, it connects me with my emotions and inspires me to create and share stories across various genres and styles. Additionally, photography has taught me to capture the beauty of fleeting moments and appreciate the often-overlooked details in our daily lives.",
            "paragraph-3": "My fascination with technology keeps me on the lookout for the latest innovations, which have the potential to improve our lives and connect with others in surprising ways. Personal development, an integral part of my life, emphasizes the importance of growth and evolution as an individual. Reading nourishes my mind by introducing new ideas and perspectives, fueling my never-ending passion for learning.",
            "paragraph-4": "In my pursuit to stay up-to-date, I make a conscious effort to continuously enrich my knowledge across various fields. This involves dedicating time to reading articles, attending workshops, and engaging in online courses that cover a wide range of subjects, from emerging trends in technology to the latest breakthroughs in science and art. By expanding my horizons, I not only enhance my skill set but also ensure that I bring a well-rounded perspective to every project I undertake."
        }
    }
}